Repository: QASchoolUSA/Pre-Trip-Inspection
Catalog: lib/l10n/app_*.arb
Languages: ru, uk

# appTitle
source: PTI Plus
ru: PTI Мобильное Приложение
uk: PTI Мобільний Додаток

source: Welcome
ru: Добро пожаловать
uk: Ласкаво просимо

source: Login
ru: Войти
uk: Увійти

source: Logout
ru: Выйти
uk: Вийти

source: Email
ru: Электронная почта
uk: Електронна пошта

source: Password
ru: Пароль
uk: Пароль

source: Forgot Password?
ru: Забыли пароль?
uk: Забули пароль?

source: Inspections
ru: Инспекции
uk: Інспекції

source: New Inspection
ru: Новая инспекция
uk: Нова інспекція

source: Pre-Trip
ru: Предрейсовая
uk: Передрейсова

source: Post-Trip
ru: Послерейсовая
uk: Післярейсова

source: Annual
ru: Годовая
uk: Річна

source: Vehicle Selection
ru: Выбор транспортного средства
uk: Вибір транспортного засобу

source: Select Vehicle
ru: Выберите транспортное средство
uk: Оберіть транспортний засіб

source: Scan QR Code
ru: Сканировать QR-код
uk: Сканувати QR-код

source: Manual Entry
ru: Ручной ввод
uk: Ручне введення

source: Vehicle Number
ru: Номер транспортного средства
uk: Номер транспортного засобу

source: License Plate
ru: Номерной знак
uk: Номерний знак

source: Status
ru: Статус
uk: Статус

source: Pass
ru: Пройдено
uk: Пройдено

source: Fail
ru: Не пройдено
uk: Не пройдено

# notApplicable
source: N/A
ru: Н/П
uk: Н/З

source: Pending
ru: Ожидание
uk: Очікування

source: Completed
ru: Завершено
uk: Завершено

source: In Progress
ru: В процессе
uk: В процесі

source: Cab and Safety Equipment
ru: Кабина и Оборудование Безопасности
uk: Кабіна та Обладнання Безпеки

source: Exterior and Coupling System
ru: Внешний Вид и Система Сцепки
uk: Зовнішній Вигляд та Система З'єднання

source: Engine Compartment
ru: Моторный Отсек
uk: Моторний Відсік

source: Under Vehicle
ru: Под транспортным средством
uk: Під транспортним засобом

source: Save
ru: Сохранить
uk: Зберегти

# saveAndExit
source: Save & Exit
ru: Сохранить и выйти
uk: Зберегти та вийти

source: Cancel
ru: Отмена
uk: Скасувати

source: Continue
ru: Продолжить
uk: Продовжити

source: Next
ru: Далее
uk: Далі

source: Previous
ru: Назад
uk: Назад

source: Complete
ru: Завершить
uk: Завершити

source: Notes
ru: Заметки
uk: Нотатки

source: Add Notes
ru: Добавить заметки
uk: Додати нотатки

source: Notes Added
ru: Заметки добавлены
uk: Нотатки додано

source: Photos
ru: Фотографии
uk: Фотографії

source: Add Photo
ru: Добавить фото
uk: Додати фото

source: Take Photo
ru: Сделать фото
uk: Зробити фото

source: Select from Gallery
ru: Выбрать из галереи
uk: Вибрати з галереї

source: Signature
ru: Подпись
uk: Підпис

source: Add Signature
ru: Добавить подпись
uk: Додати підпис

source: Clear
ru: Очистить
uk: Очистити

source: Defect Severity
ru: Серьезность дефекта
uk: Серйозність дефекту

source: Minor
ru: Незначительный
uk: Незначний

source: Major
ru: Значительный
uk: Значний

source: Critical
ru: Критический
uk: Критичний

source: REQUIRED
ru: ОБЯЗАТЕЛЬНО
uk: ОБОВ'ЯЗКОВО

source: Optional
ru: Необязательно
uk: Необов'язково

source: Language
ru: Язык
uk: Мова

source: English
ru: Английский

source: Russian
ru: Русский

source: Ukrainian
ru: Украинский

source: Spanish
ru: Испанский

source: Settings
ru: Настройки

source: App preferences
ru: Настройки приложения

source: Driver
ru: Водитель
uk: Водій

source: Quick Actions
ru: Быстрые Действия
uk: Швидкі Дії

source: Start pre-trip inspection
ru: Начать предрейсовый осмотр
uk: Почати передрейсовий огляд

source: View Reports
ru: Просмотр Отчетов
uk: Переглянути Звіти

source: Previous inspections
ru: Предыдущие осмотры
uk: Попередні огляди

source: Manage Vehicles
ru: Управление Транспортом
uk: Керування Транспортом

# addEditVehicles
source: Add or edit vehicles
ru: Добавить или редактировать транспорт
uk: Додати або редагувати транспорт

source: Statistics
ru: Статистика
uk: Статистика

source: Total Inspections
ru: Всего Осмотров
uk: Всього Оглядів

source: This Month
ru: В Этом Месяце
uk: Цього Місяця

source: Active Vehicles
ru: Активный Транспорт
uk: Активний Транспорт

source: Total Vehicles
ru: Всего Транспорта
uk: Всього Транспорту

source: Recent Activity
ru: Недавняя Активность
uk: Недавня Активність

source: No recent activity
ru: Нет недавней активности
uk: Немає недавньої активності

source: Fluid Levels
ru: Уровни жидкостей
uk: Рівні рідин

source: Photo captured successfully
ru: Фото успешно сделано
uk: Фото успішно зроблено

source: Photo added successfully
ru: Фото успешно добавлено
uk: Фото успішно додано

source: Failed to take photo
ru: Не удалось сделать фото
uk: Не вдалося зробити фото

# pdfReportGenerated
source: PDF report generated successfully!
ru: PDF отчет успешно создан!
uk: PDF звіт успішно створено!

source: Failed to generate PDF
ru: Не удалось создать PDF
uk: Не вдалося створити PDF

source: Pre-Trip Inspection Report
ru: Отчет предрейсового осмотра
uk: Звіт передрейсового огляду

# addVehiclesToStart
source: Add vehicles to get started
ru: Добавьте транспортные средства для начала
uk: Додайте транспортні засоби для початку

# tryAdjustingSearch
source: Try adjusting your search terms
ru: Попробуйте изменить поиск или добавить транспортные средства для начала.
uk: Спробуйте змінити пошук або додати транспортні засоби для початку.

# startInspection
source: Start {inspectionType}
ru: Начать {inspectionType}
uk: Почати {inspectionType}

source: Scan Vehicle QR Code
ru: Сканировать QR-код Транспорта
uk: Сканувати QR-код Транспорту

# scanInstructions
source: Position the QR code within the frame to scan
ru: Расположите QR-код в рамке для сканирования
uk: Розташуйте QR-код у рамці для сканування

source: No vehicles found
ru: Транспортные средства не найдены
uk: Транспортні засоби не знайдені

source: Search vehicles...
ru: Поиск транспортных средств...
uk: Пошук транспортних засобів...

source: Scan QR Code
ru: Сканировать QR-код
uk: Сканувати QR-код

source: Inspection Type
ru: Тип Осмотра
uk: Тип Огляду

# unitNumber
source: Unit #{unitNumber}
ru: Единица #{unitNumber}
uk: Одиниця #{unitNumber}

# vehicleSelected
source: Vehicle {unitNumber} selected
ru: Транспортное средство {unitNumber} выбрано
uk: Транспортний засіб {unitNumber} вибрано

# pleaseSelectVehicle
source: Please select a vehicle to continue
ru: Пожалуйста, выберите транспортное средство для продолжения
uk: Будь ласка, виберіть транспортний засіб для продовження

# userNotFound
source: User not found. Please check your credentials.
ru: Пользователь не найден. Пожалуйста, проверьте ваши учетные данные.
uk: Користувача не знайдено. Будь ласка, перевірте ваші облікові дані.

# failedToStartInspection
source: Failed to start inspection: {error}
ru: Не удалось начать инспекцию: {error}
uk: Не вдалося розпочати інспекцію: {error}

# vehicleManagementComingSoon
source: Vehicle Management feature coming soon!
ru: Функция управления транспортными средствами скоро будет доступна!
uk: Функція управління транспортними засобами незабаром буде доступна!

# fluidLevelsDescription
source: Check engine oil, coolant, brake fluid, power steering fluid, and windshield washer fluid levels
ru: Проверить уровни моторного масла, охлаждающей жидкости, тормозной жидкости, жидкости гидроусилителя руля и жидкости омывателя ветрового стекла
uk: Перевірити рівні моторного масла, охолоджуючої рідини, гальмівної рідини, рідини гідропідсилювача керма та рідини склоомивача

source: Belts and Hoses
ru: Ремни и Шланги
uk: Ремені та Шланги

# beltsAndHosesDescription
source: Inspect belts for cracks, fraying, proper tension. Check hoses for leaks, cracks, or soft spots
ru: Осмотреть ремни и шланги на предмет трещин, износа или повреждений
uk: Оглянути ремені та шланги на предмет тріщин, зносу або пошкоджень

# componentsCondition
source: Components and General Condition
ru: Состояние Компонентов
uk: Стан Компонентів

# componentsConditionDescription
source: Check battery, air filter, wiring, and overall engine compartment condition
ru: Проверить общее состояние компонентов двигателя
uk: Перевірити загальний стан компонентів двигуна

source: Safety Equipment
ru: Оборудование Безопасности
uk: Обладнання Безпеки

# safetyEquipmentDescription
source: Fire extinguisher, emergency triangles, first aid kit, safety vest, seat belts
ru: Проверить огнетушитель, аварийные треугольники, аптечку первой помощи
uk: Перевірити вогнегасник, аварійні трикутники, аптечку першої допомоги

source: Gauges and Controls
ru: Приборы и Управление
uk: Прилади та Управління

# gaugesAndControlsDescription
source: Dashboard gauges, warning lights, switches, and control functionality
ru: Проверить работу всех приборов и органов управления
uk: Перевірити роботу всіх приладів та органів управління

source: Brakes
ru: Тормоза
uk: Гальма

# brakesDescription
source: Brake pedal feel, air pressure, parking brake, and brake system operation
ru: Проверить тормозную систему и её работу
uk: Перевірити гальмівну систему та її роботу

source: Mirrors and Windshield
ru: Зеркала и Лобовое Стекло
uk: Дзеркала та Лобове Скло

# mirrorsAndWindshieldDescription
source: Mirror adjustment and condition, windshield condition, wipers, and washer operation
ru: Проверить зеркала, лобовое стекло и стеклоочистители
uk: Перевірити дзеркала, лобове скло та склоочисники

source: Paperwork
ru: Документация
uk: Документація

# paperworkDescription
source: Vehicle registration, insurance documentation, previous inspection reports
ru: Проверить регистрацию транспортного средства, страховку и необходимые документы
uk: Перевірити реєстрацію транспортного засобу, страховку та необхідні документи

source: Lights and Reflectors
ru: Фары и Отражатели
uk: Фари та Відбивачі

# lightsAndReflectorsDescription
source: Headlights, taillights, turn signals, brake lights, hazard lights, and reflectors
ru: Проверить все фары и отражатели транспортного средства
uk: Перевірити всі фари та відбивачі транспортного засобу

source: Tires
ru: Шины
uk: Шини

# tiresDescription
source: Tread depth, tire pressure, sidewall condition, and overall tire condition
ru: Осмотреть шины на предмет износа, повреждений и правильного давления
uk: Оглянути шини на предмет зносу, пошкоджень та правильного тиску

source: Wheels and Rims
ru: Колёса и Диски
uk: Колеса та Диски

# wheelsAndRimsDescription
source: Wheel condition, lug nuts/bolts, and rim integrity
ru: Проверить колёса и диски на предмет трещин или повреждений
uk: Перевірити колеса та диски на предмет тріщин або пошкоджень

source: Suspension
ru: Подвеска
uk: Підвіска

# suspensionDescription
source: Leaf springs, shock absorbers, air suspension, and mounting hardware
ru: Осмотреть компоненты подвески
uk: Оглянути компоненти підвіски

source: Brake Components
ru: Компоненты Тормозов
uk: Компоненти Гальм

# brakeComponentsDescription
source: Brake chambers, lines, drums/rotors, and slack adjusters
ru: Проверить тормозные магистрали, барабаны и связанные компоненты
uk: Перевірити гальмівні магістралі, барабани та пов'язані компоненти

source: Coupling System
ru: Система Сцепки
uk: Система З'єднання

# couplingSystemDescription
source: Fifth wheel, kingpin, safety chains, electrical connections, and air lines
ru: Осмотреть седельно-сцепное устройство, шкворень и соединения
uk: Оглянути сідельно-зчіпний пристрій, шворень та з'єднання

source: Trailer
ru: Прицеп
uk: Причіп

# trailerDescription
source: Trailer condition, doors, cargo securement, and landing gear
ru: Проверить общее состояние прицепа, если он присутствует
uk: Перевірити загальний стан причепа, якщо він присутній

# cdlLicense
source: CDL
ru: Лицензия CDL
uk: Ліцензія CDL

# cdlLicenseDescription
source: Commercial Driver's License validity, proper endorsements, and expiration date
ru: Проверить действительную коммерческую водительскую лицензию
uk: Перевірити дійсну комерційну водійську ліцензію

source: DOT Medical Card
ru: Медицинская Карта DOT
uk: Медична Карта DOT

# dotMedicalCardDescription
source: Medical certificate validity and expiration date
ru: Проверить действительный медицинский сертификат DOT
uk: Перевірити дійсний медичний сертифікат DOT

source: Personal/Driver Docs
ru: Личные/Водительские Документы
uk: Особисті/Водійські Документи
